CSI API ETABS v1
cCaseStaticNonlinearStaged.SetGeometricNonlinearity Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGeometricNonlinearity(
	string Name,
	int NLGeomType
)
Function SetGeometricNonlinearity (
	Name As String,
	NLGeomType As Integer
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim NLGeomType As Integer
Dim returnValue As Integer
returnValue = instance.SetGeometricNonlinearity(Name,
	NLGeomType)
int SetGeometricNonlinearity(
	String^ Name,
	int NLGeomType
)
abstract SetGeometricNonlinearity :
        Name : string *
        NLGeomType : int -> int
Parameters
Name
Type: System.String
NLGeomType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace